Revit 2016 API
Document.NewGrid Method (Arc)
 Creates a new radial grid line.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2016. Use Grid.Create() instead.")]
public Grid NewGrid(
	Arc arc
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2016. Use Grid.Create() instead.")> _
Public Function NewGrid ( _
	arc As Arc _
) As Grid
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2016. Use Grid.Create() instead.")]
public:
Grid^ NewGrid(
	Arc^ arc
)
Parameters
arc
Type: Autodesk.Revit.DB.Arc
 An arc object that represents the location of the new grid line.
Return Value
 The newly created grid line.
Remarks
 The arc should be on a horizontal plane.
Examples
CopyC#
// Create the geometry arc which the grid locates
XYZ end0 = new XYZ(0, 0, 0);
XYZ end1 = new XYZ(10, 40, 0);
XYZ pointOnCurve = new XYZ(5, 7, 0);
Arc geomArc = Arc.Create(end0, end1, pointOnCurve);
// Create a grid using the geometry arc
Grid arcGrid = Grid.Create(document, geomArc);
if (null == arcGrid)
{
    throw new Exception("Create a new curved grid failed.");
}
// Modify the name of the created grid
arcGrid.Name = "New Name2";
CopyVB.NET
   ' Create the geometry arc which the grid locates
   Dim end0 As New XYZ(0, 0, 0)
   Dim end1 As New XYZ(10, 40, 0)
   Dim pointOnCurve As New XYZ(5, 7, 0)
   Dim geomArc As Arc = Arc.Create(end0, end1, pointOnCurve)
   ' Create a grid using the geometry arc
Dim arcGrid As Grid = Grid.Create(document, geomArc)
   If arcGrid Is Nothing Then
       Throw New Exception("Create a new curved grid failed.")
   End If
   ' Modify the name of the created grid
   arcGrid.Name = "New Name2"
See Also
Document Class
NewGrid Overload
Autodesk.Revit.Creation Namespace